{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "668ddf10",
   "metadata": {},
   "outputs": [],
   "source": [
    "'''\n",
    "Задача 3 (3 балла). Руководство Китежградского университета Чародейства и \n",
    "Волшебства считает, что аудиторный фонд используется нерационально – для проведения \n",
    "занятий выделены большие аудитории, но многие студенты прогуливают занятия, в \n",
    "результате в аудиториях остается много свободных мест. Чтобы убедиться в этом, было \n",
    "решено по каждой группе на каждой паре отмечать количество присутствующих \n",
    "студентов. Тут выяснилась еще одна проблема – некоторые преподаватели \n",
    "недобросовестно отнеслись к этому поручению, и отмечали иногда явно нереальные \n",
    "значения – то 0 студентов, то в два раза больше, чем вообще есть в группе. \n",
    "Ваша задача – по имеющимся записям о посещаемости одной группы определить, какая \n",
    "доля всех записей является некорректной. \n",
    "Некорректными мы будем считать данные, которые сильно отличаются от остальных \n",
    "(в статистике это называется выбросами). Более точно алгоритм выглядит так. Пусть у нас \n",
    "есть набор данных, состоящий из N значений. Вначале найдём квартили для этого набора \n",
    "(Q1, Q2, Q3, см. справку ниже). Затем определим разброс квартилей IQR = Q3  Q1. \n",
    "Выбросами (некорректными данными) будем считать все значения, которые меньше, чем \n",
    "Q11.5*IQR, а также все значения, которые больше, чем Q3+1.5*IQR. \n",
    "Справка \n",
    "Квартили – это значения, которые разбивают упорядоченный набор чисел на 4 равных \n",
    "(по количеству чисел) части. Для их нахождения в случае дискретного набора данных \n",
    "используют следующий алгоритм. Вначале найдем вторую квартиль Q2 (она же – медиана). \n",
    "Отсортируем все числа. Пусть в наборе N значений: x1,x2,…xN. Если N нечетное, то Q2 равно \n",
    "значению, стоящему ровно в середине (то есть Q2=x(N+1)/2). Если же N четное, то Q2 равно \n",
    "среднему арифметическому двух чисел, стоящих в середине (то есть Q2=(xN/2 + xN/2+1)/2). \n",
    "После этого разделим упорядоченный набор на две равные половины (если N нечетное, то \n",
    "средний элемент, равный Q2, не включается ни в одну из половин). Числа, которые меньше \n",
    "Q2, попадут в «нижнюю» половину, а числа, которые больше Q2 – в «верхнюю». Тогда Q1 – \n",
    "это медиана «нижней» половины, а Q3 – медиана «верхней» половины. \n",
    "Входные данные \n",
    "В первой строке записано число N – количество пар, на которых отмечалась \n",
    "посещаемость группы, 5<=N<=1000. \n",
    "Далее следует N строк, в каждой записано одно целое число xi – количество студентов, \n",
    "присутствовавших на i-й паре по мнению преподавателя, 0<=xi<=100. \n",
    "Выходные данные \n",
    "Выведите одно целое число – сколько чисел из представленных можно считать \n",
    "некорректными.\n",
    "\n",
    "Пример \n",
    "Входные данные \n",
    "9 \n",
    "25 \n",
    "24 \n",
    "19 \n",
    "99 \n",
    "18 \n",
    "17 \n",
    "0 \n",
    "21 \n",
    "26 \n",
    "Выходные данные \n",
    "2 \n",
    "\n",
    "Комментарий к примеру \n",
    "После сортировки получим последовательность чисел: 0, 17, 18, 19, 21, 24, 25, 26, 99. По \n",
    "алгоритму находим Q2=21. «Нижняя» половина – это числа 0, 17, 18, 19. Соответственно, \n",
    "Q1=(17+18)/2=17.5. «Верхняя» половина – это числа 24, 25, 26, 99. Q3=(25+26)/2=25.5. Тогда \n",
    "IQR = Q3Q1 = 25.517.5 = 8. Таким образом, некорректными в данной задаче будут считаться \n",
    "значения, которые меньше, чем 17.51.5*8=17.512=5 (такое значение всего одно – число 0), а \n",
    "также которые больше, чем 25.5+1.5*8=25.5+12=37.5 (такое значение тоже всего одно – число 99). \n",
    "Итого, всего 2 числа (0 и 99) считаются некорректными.\n",
    "'''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "79578eed",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2\n"
     ]
    }
   ],
   "source": [
    "def main(data, n):\n",
    "    data = sorted(data)\n",
    "    lower_half = []\n",
    "    upper_half = []\n",
    "\n",
    "    if n % 2 == 0:\n",
    "        Q2 = (data[n // 2 - 1] + data[n // 2]) / 2\n",
    "        lower_half = data[:n // 2]\n",
    "        upper_half = data[n // 2:]\n",
    "    else:\n",
    "        Q2 = data[n // 2]\n",
    "        lower_half = data[:n // 2]\n",
    "        upper_half = data[n // 2 + 1:]\n",
    "\n",
    "    if len(lower_half) % 2 == 0:\n",
    "        Q1 = (lower_half[len(lower_half) // 2 - 1] + lower_half[len(lower_half) // 2]) / 2\n",
    "    else:\n",
    "        Q1 = lower_half[len(lower_half) // 2]\n",
    "\n",
    "    if len(upper_half) % 2 == 0:\n",
    "        Q3 = (upper_half[len(upper_half) // 2 - 1] + upper_half[len(upper_half) // 2]) / 2\n",
    "    else:\n",
    "        Q3 = upper_half[len(upper_half) // 2]\n",
    "\n",
    "    IQR = Q3 - Q1\n",
    "\n",
    "    lower_limit = Q1 - 1.5 * IQR\n",
    "    upper_limit = Q3 + 1.5 * IQR\n",
    "\n",
    "    count=0\n",
    "    for i in data:\n",
    "        if i < lower_limit or i > upper_limit:\n",
    "            count += 1\n",
    "\n",
    "    return count\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    N = int(input())\n",
    "    Data = [int(input()) for _ in range(N)]\n",
    "    result = main(Data, N)\n",
    "    print(result)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
