{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "720f9d88",
   "metadata": {},
   "outputs": [],
   "source": [
    "'''\n",
    "Задача 3. Начинающий предприниматель Александр открыл свою первую пиццерию.\n",
    "Для учета заказов он использует максимально простой инструмент – записывает в блокнот информацию о дате заказа, \n",
    "названии пиццы и стоимости заказа (стоимость одной и той же пиццы даже в один и тот же день может быть разной – это \n",
    "зависит от дополнительных ингредиентов, которые пожелал добавить клиент, но которые Александр в своем блокноте никак \n",
    "не учитывает). По прошествии нескольких дней Александр хочет извлечь из своих записей какую-нибудь полезную информацию. \n",
    "Напишите программу, которая будет выводить:\n",
    "а) список всех пицц с указанием, сколько раз их заказывали; список должен быть отсортирован по убыванию количества заказов, \n",
    "то есть первой в списке должна оказаться самая популярная пицца;\n",
    "б) список всех дат с указанием суммарной стоимости проданных в этот день пицц; список должен быть отсортирован хронологически;\n",
    "в) информацию о самом дорогом заказе;\n",
    "г) среднюю стоимость заказа (среднее арифметическое по всем стоимостям). \n",
    "Поскольку исходный текстовый файл заполняется вручную, то формат данных может быть разным (даже в рамках одного файла). \n",
    "Гарантируется только, что каждая строка файла содержит информацию об одном заказе, и в каждой строке указаны 3 значения: \n",
    "дата, название и стоимость. Нужно учесть следующие варианты:\n",
    "- значения могут быть разделены запятой, точкой с запятой или просто пробелом;\n",
    "- в дате дата, месяц и год могут быть разделены точкой или косой чертой (/);\n",
    "- название пиццы может быть указано в кавычках или без них;\n",
    "- стоимость может быть целым или дробным числом (если число дробное, то в нем не более 2 знаков в дробной части, \n",
    "при этом дробная часть от целой может быть отделена точкой или запятой).\n",
    "\n",
    "Если строка не соответствует указанному формату (с учетом указанных вариантов), то такую строку нужно пропускать.\n",
    "'''\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "ee9b0448",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "а) Популярные пиццы:\n",
      "Пепперони: 4 заказов\n",
      "Четыре сыра: 3 заказов\n",
      "Гавайская: 2 заказов\n",
      "Баварская: 2 заказов\n",
      "\n",
      "б) Суммарные продажи по датам:\n",
      "20.02.2025 440.0\n",
      "21.02.2025 399.9\n",
      "27.02.2025 388.8\n",
      "28.02.2025 1694.99\n",
      "01.03.2025 830.49\n",
      "02.03.2025 400.0\n",
      "03.03.2025 480.0\n",
      "\n",
      "в) Самый дорогой заказ: \n",
      "03.03.2025 Баварская 480.0\n",
      "\n",
      "г) Средняя стоимость заказа: \n",
      "421.29\n"
     ]
    }
   ],
   "source": [
    "import re # Импортируем модуль регулярных выражений для обработки строк\n",
    "from collections import defaultdict\n",
    "from datetime import datetime\n",
    "\n",
    "def parse_order(line):\n",
    "    # Регулярное выражение для парсинга строки                  \n",
    "    pattern = r'(?P<date>\\d{1,2}[/\\.]\\d{1,2}[/\\.]\\d{2,4})\\s*[;, \"\\']*\\s*(?P<pizza>.+?)[\"\\']?\\s*[;, ]*\\s*(?P<price>\\d+[.,]?\\d{0,2})'\n",
    "    match = re.match(pattern, line.strip())\n",
    "    if match:\n",
    "        date, pizza, price = match.groups()\n",
    "        date = date.replace('/', '.')\n",
    "        price = float(price.replace(',', '.'))\n",
    "        return date, pizza.strip(), price\n",
    "    return None\n",
    "\n",
    "def main():\n",
    "    pizza_count = defaultdict(int)\n",
    "    daily_sales = defaultdict(float)\n",
    "    max_order = (None,None, 0)  # (дата, пицца, стоимость)\n",
    "    total_orders = 0\n",
    "    total_cost = 0.0\n",
    "\n",
    "    with open('Lab01_task3_input.txt', 'r', encoding='utf-8') as file:\n",
    "        for line in file:\n",
    "            order = parse_order(line.strip())\n",
    "            if order:\n",
    "                date, pizza, price = order\n",
    "                pizza_count[pizza] += 1\n",
    "                daily_sales[date] += price\n",
    "                total_orders += 1\n",
    "                total_cost += price\n",
    "                if price > max_order[2]:\n",
    "                    max_order = (date, pizza, price)\n",
    "\n",
    "    # a) Популярные пиццы\n",
    "    sorted_pizzas = sorted(pizza_count.items(), key=lambda x: x[1], reverse=True)\n",
    "    print(\"а) Популярные пиццы:\")\n",
    "    for pizza, count in sorted_pizzas:\n",
    "        print(f\"{pizza}: {count} заказов\")\n",
    "\n",
    "    # b) Продажи по датам\n",
    "    sorted_dates = sorted(daily_sales.items(), key=lambda item: datetime.strptime(item[0], \"%d.%m.%Y\")) #Преобразует строковые даты в объекты `datetime` и сортирует\n",
    "    print(\"\\nб) Суммарные продажи по датам:\")\n",
    "    for date, total in sorted_dates:\n",
    "        print(f\"{date} {total}\")\n",
    "\n",
    "    # c) Самый дорогой заказ\n",
    "    print(f\"\\nв) Самый дорогой заказ: \\n{max_order[0]} {max_order[1]} {max_order[2]}\")\n",
    "\n",
    "    # d) Средняя стоимость заказа\n",
    "    average_cost = total_cost / total_orders if total_orders > 0 else 0\n",
    "    print(f\"\\nг) Средняя стоимость заказа: \\n{average_cost:.2f}\")\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
